app/controllers/forums_controller.rb

  def index
    @forums = Forum.all
---
SELECT * FROM "forums"

  def show
    @forum = Forum.find(params[:id], :include => :topics)
---
SELECT "topics".* FROM "topics" WHERE ("topics".forum_id = 1)
SELECT * FROM "forums" WHERE ("forums"."id" = 1)

  def edit
    @forum = Forum.find(params[:id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 1)

  def create
    @forum = Forum.new(params[:forum])

    respond_to do |format|
      if @forum.save
---
INSERT INTO "forums" ("name", "updated_at", "description", "created_at") VALUES('惠州商盟', '2010-05-26 07:25:37', ' 一個普通的夢想,一直想構建一個論壇來代替Discuz!版本的論壇,但一直沒動工,現在動工開開遲了沒. ', '2010-05-26 07:25:37')