app/controllers/replies_controller.rb

  def create
    @forum = @topic.forum
    @reply = @topic.replies.build(params[:reply])

    respond_to do |format|
      if @reply.save
---
INSERT INTO "replies" ("topic_id", "updated_at", "title", "body", "forum_id", "created_at") VALUES(1, '2010-05-26 10:35:07', '日啊', '你這個雞巴老~來和諧我把', NULL, '2010-05-26 10:35:07')

 def load_topic
  @topic = Topic.find(params[:topic_id])
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)