app/controllers/topics_controller.rb

  def show
    @topic = Topic.find(params[:id])
    @replies = @topic.replies.paginate :page => params[:page] || 1,:per_page=> 20
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)
SELECT * FROM "replies" WHERE ("replies".topic_id = 1) LIMIT 20 OFFSET 0

  def edit
    @topic = Topic.find(params[:id])
---
SELECT * FROM "topics" WHERE ("topics"."id" = 1)

  def create
    @topic = Topic.new(params[:topic])
    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("hits", "updated_at", "title", "body", "replies_count", "forum_id", "sticky", "created_at") VALUES(0, '2010-05-26 10:33:49', 'In the futrue I know I was wrong', '明日復明日,明日何其甚,我生待明日,明日白了頭', 0, 1, 1, '2010-05-26 10:33:49')